var questions = [
    {
        text: "Год рождения:",
        validation: {
            minWidth: 4
        },
        answer: ""
    },
    {
        text: "Город, в котором вы живёте",
        validation: {
            minWidth: 1
        },
        answer: ""
    },
    {
        text: "Вуз, факультет, специальность, кафедра",
        validation: {
            minWidth: 20
        },
        answer: ""
    },
    {
        text: "Год окончания вуза",
        validation: {
            minWidth: 4
        },
        answer: ""
    },
    {
        text: "Уровень владения английским языком",
        validation: {
            minWidth: 4
        },
        answer: ""
    },
    {
        text: "Чего вы ожидаете от участия в Школе?",
        validation: {
            minWidth: 4
        },
        answer: ""
    },
    {
        text: "Откуда вы о нас узнали?",
        validation: {
            minWidth: 4
        },
        answer: ""
    },
    {
        text: "Сколько времени вы были бы готовы уделять стажировке или работе в Яндексе?",
        validation: {
            minWidth: 4
        },
        answer: ""
    },
    {
        text: "Расскажите о вашем опыте разработки. Нам будет интересно всё — как серьезный интерфейс, так и просто домашняя страничка.",
        validation: {
            minWidth: 4
        },
        answer: ""
    },
    {
        text: "Если вы где-нибудь работали, расскажите, какие у вас были должностные обязанности и был ли опыт работы в команде.",
        validation: {
            minWidth: 4
        },
        answer: ""
    },
    {
        text: "Перечислите, какими программными продуктами вы пользуетесь в своей работе — от редактора до специализированных утилит (Intellij Idea, Node.js, Uglify.js, GNU Make). Для каждого инструмента укажите, какие задачи вы с помощью него решаете и почему выбрали именно его.",
        validation: {
            minWidth: 4
        },
        answer: ""
    },
    {
        text: "Пользуетесь ли вы командной строкой? Какими командами вы пользуетесь и какие задачи вы решаете с их помощью? С какими программами вы преимущественно или полностью взаимодействуете через интерфейс командной строки?",
        validation: {
            minWidth: 4
        },
        answer: ""
    },
    {
        text: "Напишите на JavaScript функцию, которая выводит список всех чисел, которые равны сумме факториалов своих цифр. Пример такого числа: 4! + 0! + 5! + 8! + 5! = 40585 В качестве ответа на вопрос пришлите ссылку на http://jsfiddle.net/ с вашим кодом или на ваш репозиторий на https://github.com/.",
        validation: {
            minWidth: 4
        },
        answer: ""
    },
    {
        text: "Вы — пилот грузового межгалактического корабля. Ваша работа — перевозка грузов с одной планету на другую. Грузоподъемность вашего корабля ограничена, поэтому за один рейс вы можете перевезти не более N кг полезного груза. Ваш корабль умеет сообщать свое состояние (местоположение и степень загруженности), а также летать в любую точку пространства. Каждая планета может содержать на себе груз, который можно взять. Также на каждой планете груз можно оставить. Задание: Даны незавершенные интерфейсы корабля и планеты. Напишите недостающий код.Полное условие задачи доступно на https://github.com/yandex-shri/introtask-space.В качестве ответа на вопрос пришлите ссылку на http://jsfiddle.net/ с вашим кодом или на ваш репозиторий на https://github.com/.",
        validation: {
            minWidth: 4
        },
        answer: ""
    },
    {
        text: "Cверстайте форму-анкету с нашими заданиями для кандидатов. Страница должна работать в следующих браузерах: MSIE (8, 9, 10), Google Chrome (26, 27), Firefox (20, 21), Opera (12.15, 12.14), Яндекс.Браузер 1.5. По возможности используйте приёмы безопасной деградации CSS. Страница должна содержать интерактив, реализованный с помощью JS и jQuery.",
        validation: {
            minWidth: 4
        },
        answer: ""
    }
];
